In [14]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

# Dateframe

### dateframe 是可以给多维的数组添加索引, 创建方法是传入一个字典

In [2]:
# 创建一个Dataframe
df = DataFrame({"height":[175, 160, 168, 167, 173], 
                "age": np.random.randint(18, 25, size = 5), 
               "sex":['男', '女', '男', '女', '男']})
df

   height  age sex
0     175   21   男
1     160   23   女
2     168   23   男
3     167   20   女
4     173   19   男

In [5]:
df1 = DataFrame({'张三':[150, 150, 150, 300],
                '李四':[0, 0, 0, 0]})
df1

    张三  李四
0  150   0
1  150   0
2  150   0
3  300   0

In [7]:
# 以上的值都是可以改变的
df1.index = ['语文', '数学', '英语', '理综']
df1

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  300   0

## Dataframe 的索引

In [8]:
df

   height  age sex
0     175   21   男
1     160   23   女
2     168   23   男
3     167   20   女
4     173   19   男

In [10]:
# 检索返回值，类型为Series
# 不能检索行
age = df['age']
display(type(age), age)

pandas.core.series.Series

0    21
1    23
2    23
3    20
4    19
Name: age, dtype: int32

In [21]:
# 对于Dataframe 而言，列名就相当于属性，一个Dataframe相当于是一个事务，每列是他的属性
# 不能取出行
df.age

0    21
1    23
2    23
3    20
4    19
Name: age, dtype: int32